import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrls: ['./about.component.scss']
})
export class AboutComponent implements OnInit {

  content: any = [];

  constructor() { }

  ngOnInit(): void {
    this.loadAbout();
  }

  loadAbout() {
    this.content.push(
      "கலைஞர் பெற்ற முதற்குழந்தை முரசொலி. அதற்கு அவர் தந்தையும் தாயுமானார். கலைஞரின் அத்தனை போர்க்குணங்களும் முரசொலிக்கு உண்டு. ஏனெனில் கலைஞரின் மற்றொரு வடிவமே முரசொலி. அவரின் எல்லா மெய்ப்பாடுகளையும் முரசொலி காலந்தோறும் எதிரொலித்தே வந்து கொண்டிருக்கிறது.",
      "திராவிடர் இயக்கத்தின் போர்வாளாக திகழ்ந்து வருகிற முரசொலிக்கு இது மணிவிழா ஆண்டு மணிவிழா ஆண்டு என்பதால் இவ்வேட்டின் அறுபது ஆண்டு காலப் பணிகளை நினைவு கூர்வதும் அதன் சிறப்புகளை மீண்டுமொரு முறை அதன் வாசகர்களிடையே எடுத்து வைப்பதும் ஒரு வரலாற்றுத் தேவையே ஆகும்.",
      "முரசொலி அரசியல் மேடையாக, சமுதாய அரங்கமாக, இலக்கியப் பூஞ்சோலையாக அடியெடுத்து வைத்த ஏடாகும். அது இரண்டாம் உலகப் போரின் போது (1939-45) பிறந்த ஏடாகும். இவ்வேடு முதலில் துண்டறிக்கைகளாகவே வெளியிடப்பட்டு வந்தது. கலைஞரது 18-ஆம் வயதில் முரசொலி (10-8-1942) முதன் முதலில் வெளியாயிற்று. அப்போது போர்க் காலமாதலால் அந்த துண்டறிக்கையை நல்ல தாளில் கூட அச்சடிக்க முடியவில்லை. கிடைத்த தாள்களில் அச்சிடப்பட்டு வெளிவந்து கொண்டிருந்தது. கிராப்ட் தாள்களில் கூட அச்சிடப்பட்டன. முரசொலி துண்டறிக்கைகள் என்பது இதழுக்குரிய (Periodical) பாங்குடன் வெளியிடப்படவில்லை. இவ்விதழ் கூட 1942 முதல்1944 வரை தான் வெளிவந்தது.",
      "முரசொலியின் தலைப்பின் மீது ‘V’ என்று போடப்பட்டுள்ளதை பார்க்கலாம். உலகப் போர் நடந்து கொண்டிருந்ததால் வெற்றிக்கு அறிகுறியாக Victory என்ற சொல்லின் முதலெழுத்தைப் போட்டு முரசொலி துண்டறிக்கைகள் அச்சிடப்பட்டு வந்தன. முரசொலி பிறக்கும் போதே முகத்தில் வெற்றியைப் பொறித்துக் கொண்டே பிறந்த ஏடாகும். எந்த அற்பங்களும் அந்த ஏட்டை வெற்றிகொள்ள முடியாது.",
      "கலைஞரின் முரசொலி அறிக்கைகளை காங்கிரஸ்காரரான நாராயணசாமி பிள்ளை அச்சிட்டு தந்தது வியப்பையே அளிக்கிறது. அதுவும் அந்நாளில்? அதற்கு காரணம் என்ன? கலைஞர் அந்த இளமைப் பருவத்திலேயே மற்றவர்களை தம்முடைய ‘வாக்குத் திறத்தாலே’ கவருகின்ற ஆற்றலைப் பெற்றிருந்தார். நாராயணசாமி பிள்ளை கலைஞரிடம் பேச்சுக் கொடுத்து உரையாடி மகிழ்வதிலே இன்பம் கண்டவர். இத்துண்டறிக்கைகள் ‘கனமான’ விஷயங்களையே தாங்கி வந்தன.") ;
  }

}
